Autodesk.Revit.DB.WorksharingSaveAsOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.WorksharingSaveAsOptions.ClearTransmitted
For a transmitted model opened with DetachAndPreserveWorksets,
clear its transmitted flag in the Save/SaveAs operation.
Since:
2014

Autodesk.Revit.DB.WorksharingSaveAsOptions.OpenWorksetsDefault
The default set of user-worksets to open when opening the model in the UI.
Default is AskUserToSpecify.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.WorksharingSaveAsOptions.SaveAsCentral
Whether to save the new model as a central instead of local model.
True: save as a central model.
Default is false: save as a local model.
Remarks:
Must be true for a model where the model has not yet been saved as a central
after either worksharing has just been enabled
or the model was opened detached from central
and .
Since:
2014

Autodesk.Revit.DB.WorksharingSaveAsOptions.#ctor
Constructs a new WorksharingSaveAsOptions with default settings.
Since:
2014

Autodesk.Revit.DB.WorksharingSaveAsOptions
This class contains options specific to worksharing SaveAs.
Since:
2014